# Rebar Set Crank Length Override Method

Source: https://www.revitapidocs.com/2026/5ed493ae-0f3d-bca2-0c8e-c71366220221.htm

---

| Rebar Set Crank Length Override Method |
| --- |

Sets the crank length at the indicated bar end as an override value.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetCrankLengthOverride(
	int end,
	double crankLength
)
```

```
Public Sub SetCrankLengthOverride (
	end As Integer,
	crankLength As Double
)
```

```
public:
void SetCrankLengthOverride(
	int end,
	double crankLength
)
```

```
member SetCrankLengthOverride :
        end : int *
        crankLength : float -> unit
```

#### Parameters

end Int32
:   The bar end.

crankLength Double
:   The crank length.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1\. |
| InvalidOperationException | The bar does not have a valid Rebar Crank Type at the end.  \-or\-  The ability to override crank lengths is not enabled for this rebar instance. Use enableCrankLengthOverride(true) to enable it. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace